CF/InformationRegisters/НастройкаСпособаУчетаСебестоимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>НастройкаСпособаУчетаСебестоимости</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СпособУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыУчетаСебестоимости</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РассчитыватьСебестоимостьРегламентнымЗаданием</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РаспределятьСтоимостьУслуг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПравилоРаспределения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПравилаРаспределенияНаСебестоимостьТоваров</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CF/Enums/СпособыУчетаСебестоимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>СпособыУчетаСебестоимости</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АвтономныйУчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриниматьИзУправляющейСистемы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвтономныйУчетСредняяВзвешенная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CF/InformationRegisters/НастройкаСпособаУчетаСебестоимости/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	НастроитьДоступностьСпособовУчета();
	НастроитьДоступностьОбновлятьСтоимостьРегламентнымЗаданием();
	НастроитьДоступностьРаспределенияУслуг(Ложь);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СпособУчетаПриИзменении(Элемент)
	НастроитьДоступностьОбновлятьСтоимостьРегламентнымЗаданием();
	
	Если Запись.СпособУчета = ПредопределенноеЗначение("Перечисление.СпособыУчетаСебестоимости.ПриниматьИзУправляющейСистемы") Тогда
		НастроитьДоступностьРаспределенияУслуг(Истина);
	Иначе
		НастроитьДоступностьРаспределенияУслуг();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределятьСтоимостьУслугПриИзменении(Элемент)
	Элементы.ПравилоРаспределения.ТолькоПросмотр = НЕ Запись.РаспределятьСтоимостьУслуг;
	
	Если НЕ Запись.РаспределятьСтоимостьУслуг Тогда
		Запись.ПравилоРаспределения = Неопределено;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастроитьДоступностьСпособовУчета()
	
	КомментарийСпособУчетаСебестоимости = "";
	Если НЕ Константы.ИспользоватьСинхронизациюДанных.Получить() Тогда
		
		КомментарийСпособУчетаСебестоимости = НСтр("ru = 'Не возможен выбор ""Принимать из управляющей системы"":
		|- выключена синхронизация данных в разделе ""Синхронизация данных""
		|- нет действующих обменов с УТ.'");
		
		
		
	ИначеЕсли Константы.ИспользоватьСинхронизациюДанных.Получить() И НЕ Константы.ИспользуетсяОбменСУправлениемТорговлей.Получить() Тогда
		
		КомментарийСпособУчетаСебестоимости = НСтр("ru = 'Не возможен выбор ""Принимать из управляющей системы"":
		|- нет действующих обменов с УТ.'");
		
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(КомментарийСпособУчетаСебестоимости) Тогда
		
		Элементы.СпособУчета.ОтображениеПодсказки = ОтображениеПодсказки.Кнопка;
		Элементы.СпособУчета.Подсказка = КомментарийСпособУчетаСебестоимости;
		
		ЭлементПриниматьИзУТ = Элементы.СпособУчета.СписокВыбора.НайтиПоЗначению(Перечисления.СпособыУчетаСебестоимости.ПриниматьИзУправляющейСистемы);
		
		Если НЕ ЭлементПриниматьИзУТ = Неопределено Тогда
			
			Элементы.СпособУчета.СписокВыбора.Удалить(ЭлементПриниматьИзУТ);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьДоступностьОбновлятьСтоимостьРегламентнымЗаданием()
	
	Если Запись.СпособУчета = Перечисления.СпособыУчетаСебестоимости.АвтономныйУчетСредняяВзвешенная Тогда
		
		Элементы.ОбновлятьРегламентнымЗаданием.ТолькоПросмотр = Ложь;
		Элементы.ОбновлятьРегламентнымЗаданием.ОтображениеПодсказки = ОтображениеПодсказки.Авто;
		Элементы.ОбновлятьРегламентнымЗаданием.Подсказка = "";
		
	Иначе
		Запись.РассчитыватьСебестоимостьРегламентнымЗаданием = Ложь;
		Элементы.ОбновлятьРегламентнымЗаданием.ТолькоПросмотр = Истина;
		Элементы.ОбновлятьРегламентнымЗаданием.ОтображениеПодсказки = ОтображениеПодсказки.Кнопка;
		Элементы.ОбновлятьРегламентнымЗаданием.Подсказка = НСтр("ru = 'Доступно при расчете по средней взвешенной оценке.'");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьДоступностьРаспределенияУслуг(СброситьФлаг = Ложь)
	
	Если СброситьФлаг Тогда
		Запись.РаспределятьСтоимостьУслуг = Ложь;
		Запись.ПравилоРаспределения = Неопределено;
	КонецЕсли;
	
	Если Запись.СпособУчета = Перечисления.СпособыУчетаСебестоимости.ПриниматьИзУправляющейСистемы Тогда
		Элементы.РаспределятьСтоимостьУслуг.ТолькоПросмотр = Истина;
		Элементы.ПравилоРаспределения.ТолькоПросмотр = Истина;
		Элементы.ПравилоРаспределения.ОтображениеПодсказки = ОтображениеПодсказки.Кнопка;
		Элементы.ПравилоРаспределения.Подсказка = НСтр("ru = 'Недоступно при способе учета ""Принимать из управляющей системы""'");
		
	Иначе
		Элементы.РаспределятьСтоимостьУслуг.ТолькоПросмотр = Ложь;
		Элементы.ПравилоРаспределения.ТолькоПросмотр = Ложь;
		Элементы.ПравилоРаспределения.ОтображениеПодсказки = ОтображениеПодсказки.Авто;
		Элементы.ПравилоРаспределения.Подсказка = "";
	КонецЕсли;
	
	Элементы.ПравилоРаспределения.ТолькоПросмотр = НЕ Запись.РаспределятьСтоимостьУслуг;
	
КонецПроцедуры

#КонецОбласти
